// 3.	Даны два числа. Показать большее и меньшее число

int a = 23;
int b = 45;
System.Console.WriteLine(Math.Max(a, b));
System.Console.WriteLine(Math.Min(a, b));

