// 6.	Написать программу вычисления значения функции y = f(a)

/* это я написал для примера
int y, a;
string? s=Console.ReadLine();
a=Convert.ToInt32(s);
if (a == 0)
{
    y = 0;
}
else
{
    y = 2 * Math.Abs(a) + 10;
}

System.Console.WriteLine(y);
*/

double x = Math.PI;
double y = Math.Sin(x);
System.Console.WriteLine(y);
System.Console.WriteLine(9.0/10.0);