// 24. Вывести на экран таблицу квадратов чисел от 1 до N

int N=8;
int i=1;
while(i<=N)
{
    int a=2;
    System.Console.Write($"{i}^2={Math.Pow(i,a)}  ");
    i++;
}